export default {
  navigator: {
    resources: {
      title: '资源',
      frontend: {
        title: '浏览器端'
      },
      backend: {
        title: '服务器端'
      },
    },
    author: '作者',
    about: '关于',
  },
  home_page: {
    title: '主页'
  },
  author_page: {
    title: '作者',
    brief: '我是尹凯年，一个有两年多软件开发经验的程序员。现在的工作主要是使用Java语言进行后端的开发，偶尔也会写写前端，玩玩新的技术。一直以来在敏捷方式下工作，熟悉微服务架构，喜欢团队氛围。希望有机会认识更多的朋友，共同进步。',
    college_interval: '就读于中山大学数据科学与计算机学院，专业是计算机科学与技术。在大学期间，通过学习获得了扎实的专业知识，为从事软件开发的职业生涯打下了基础。中山大学在文化方面兼容并包、思维方面勇于开拓，极大的扩展了我的视野并影响了我的思维方式，我内心很感激并怀念这四年的大学时光。',
    intern_interval: '在易联支付实习。在实习期间主要开发一个对接中国检验检疫的报关系统的程序，从IBM MQ接受报文，使用FTP上传到对端。',
    first_job_interval: '工作于爱立信移动数据应用研究与开发（广州）有限公司。',
    second_job_interval: {
      title: '2018.07至今',
      content:'加入微众银行，并从广州来到了深圳。在微众银行，我主要的工作内容是开发一个测试管理平台。'
    },
    what_i_did: {
      title: '参与的工作',
      content: '在爱立信工作期间，我参与了ABAC和CDM等几个项目；现在在微众银行，主要负责测试平台中CI/CD相关部分的开发。'
    },
    where_i_am: {
      title: '当前地址'
    }
  },
  about_page: {
    title: '关于',
    orientation: {
      title: '由来',
      p1: 'JAVA工程师日常工作是服务端开发，但是随着越来越多公司采用敏捷方式管理项目，后端工程师也有机会参与前端功能的开发。由于本人一直有参与前端功能的开发，对前端技术一直有所关注。',
      p2: '由于VueJS在国内应用变得广泛，在学习这项技术的过程中，开发了这个主页。',
      // p3: '因此，有了这人主页。'
    },
    tools: {
      title: '技术',
      start: '在本站中，使用了很多模块：'
    }
  }
}
